---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.PointCloud
source: html/d747036b-f364-5b2f-4c5b-4f4a8005dfa8.htm
---
# Autodesk.Revit.DB.ExternalResourceTypes.BuiltInExternalResourceTypes.PointCloud Property

An external resource type representing Point Clouds.
 This type is reserved for future expansion but not yet implemented.

## Syntax (C#)
```csharp
public static ExternalResourceType PointCloud { get; }
```